bhargav99786/scanpro-x1/esp_idf_firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Flash settings (N16R8 board)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# App Partition settings
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# OTA settings
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y
# PSRAM settings (8MB Octal)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536

# CPU freq
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# LVGL specifics
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y

# ── Bluetooth / NimBLE ───────────────────────────────────────────────────────
# Enable BT controller and NimBLE host so the device shows up on phone BLE scans
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_BLUEDROID_ENABLED=n
# NimBLE role: peripheral + broadcaster (advertising only)
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
# BLE device name shown in phone Bluetooth scans
CONFIG_BT_NIMBLE_SVC_GAP_DEVICE_NAME="ScanPro-X1"
# NimBLE host task stack
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=4096
